# Используем официальный образ Node.js в качестве базового
FROM node:16-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install --legacy-peer-deps

# Копируем весь исходный код приложения в рабочую директорию контейнера
COPY . .

# Сборка приложения
RUN npm run build

# Устанавливаем сервер для обслуживания приложения (например, serve)
RUN npm install -g serve

# Определяем команду для запуска веб-сервера на порту 3000
CMD ["serve", "-s", "build", "-l", "3000"]

# Открываем порт 3000 для доступа к приложению
EXPOSE 3000
